/****************************************************************
	Module: AR_MENU
	Top Level Logic: MENU_LOGIC
	Date: 20-Mar-90
	Program Revision: 0.00
	S/G Revision: 0.00
****************************************************************/

%include "FIO.IN";

/****************************************************************
	AR_MENU
	Logic for menu programs
****************************************************************/

%replace AR_MENU_1 by 138;
AR_MENU:
   procedure;
%include "AR_MENU.DD";

declare		END_SELECT_AND_RUN   bit (1);
declare		ERROR_CODE           fixed binary (15);
declare		NOT_FIRST_TIME       bit (1);
   call INITIALIZE;
   END_SELECT_AND_RUN = NO;
   do while (END_SELECT_AND_RUN ^= YES);
      call SELECT_AND_RUN;
   end;
   call END_PROGRAM;
return;

/****************************************************************
	INITIALIZE
	Initialize the program
****************************************************************/

INITIALIZE:
	procedure;


   /* INIT_FILE_VARS - Initialize the file variables */


   /* INIT_PROG_VARS - INITIALIZE THE PROGRAM VARIABLES */

   NOT_FIRST_TIME = "0"b;

   /* DISPLAY_SCREEN - Display the screen */

   call OPEN_SCREEN;
   call DISPLAY_SCREEN (AR_MENU_1);

   /* OPEN_FILES - Open all the files for this program */

   call SET_SCREEN_VARS (byteaddr (AR_MENU_RECORD) );
return;
end;	/* INITIALIZE           */

/****************************************************************
	SELECT_AND_RUN
	Select option and run
****************************************************************/

SELECT_AND_RUN:
	procedure;

declare		INPUT_LENGTH         fixed binary (15);
declare		RETURN_CODE          fixed binary (15);

   /* REDIS_AND_SET - Redisplay the screen and set the var ptr */

   if NOT_FIRST_TIME then
      do;
      call DISPLAY_SCREEN (AR_MENU_1);

      /* SET_SCRN_VARS - Set the screen variables pointer */

      call SET_SCREEN_VARS (byteaddr (AR_MENU_RECORD) );
      end;
   NOT_FIRST_TIME = YES;

   /* INPUT_OPTION - Input the option on the screen */

   call INPUT_FIELD (  1,INPUT_LENGTH,RETURN_CODE);
   if (AR_SELECT = 0) !
        (RETURN_CODE ^= NORMAL_RETURN) then
      do;
      END_SELECT_AND_RUN = YES;
      return;
      end;

   /* CALL_PROGRAM - Dispatch to the right program */

   declare AR_CTL_MAINT entry;
   declare AR_CASH_MENU entry;
   declare AR_MCO_MENU entry;
   declare AR_CR_DR_ENT entry;
   declare AR_REFUND_REV entry;
   declare AR_REFUND_PRT entry;
   declare AR_BOOK_INQ entry;
   declare AR_INQUIRY entry;
   declare AR_RPT_MENU entry;
   declare AR_DIST_GL entry;
   declare AR_PURGE entry;
   do case (AR_SELECT);
         /* Option   1 */
      call AR_CTL_MAINT(
);
         /* Option   2 */
      call AR_CASH_MENU(
);
         /* Option   3 */
      call AR_MCO_MENU(
);
         /* Option   4 */
      call AR_CR_DR_ENT(
);
         /* Option   5 */
      call AR_REFUND_REV(
);
         /* Option   6 */
      call AR_REFUND_PRT(
);
         /* Option   7 */
      call AR_BOOK_INQ(
);
         /* Option   8 */
      call AR_INQUIRY(
);
         /* Option   9 */
      call AR_RPT_MENU(
);
         /* Option  10 */
      call AR_DIST_GL(
);
         /* Option  11 */
      call AR_PURGE(
);
   end;
   otherwise
      do;
      end;
return;
end;	/* SELECT_AND_RUN       */

/****************************************************************
	END_PROGRAM
	End of program stuff
****************************************************************/

END_PROGRAM:
	procedure;


   /* CLOSE_FILES - Close all the files for this program */

return;
end;	/* END_PROGRAM          */
end;	/* END_PROGRAM          */
/*********************************End of Program*********************/
