/****************************************************************
	Module: TK_MENU
	Top Level Logic: MENU_LOGIC
	Date: 15-Feb-94
	Program Revision: 0.00
	S/G Revision: 0.00
****************************************************************/

%include "FIO.IN";

/****************************************************************
	TK_MENU
	Logic for menu programs
****************************************************************/

%replace TK_MENU_1 by 191;
TK_MENU:
   procedure;
%include "TK_MENU.DD";

declare		END_SELECT_AND_RUN   bit (1);
declare		ERROR_CODE           fixed binary (15);
declare		NOT_FIRST_TIME       bit (1);
   call INITIALIZE;
   END_SELECT_AND_RUN = NO;
   do while (END_SELECT_AND_RUN ^= YES);
      call SELECT_AND_RUN;
   end;
   call END_PROGRAM;
return;

/****************************************************************
	INITIALIZE
	Initialize the program
****************************************************************/

INITIALIZE:
	procedure;


   /* INIT_FILE_VARS - Initialize the file variables */


   /* INIT_PROG_VARS - INITIALIZE THE PROGRAM VARIABLES */

   NOT_FIRST_TIME = "0"b;

   /* DISPLAY_SCREEN - Display the screen */

   call OPEN_SCREEN;
   call DISPLAY_SCREEN (TK_MENU_1);

   /* OPEN_FILES - Open all the files for this program */

   call SET_SCREEN_VARS (byteaddr (TK_MENU_RECORD) );
return;
end;	/* INITIALIZE           */

/****************************************************************
	SELECT_AND_RUN
	Select option and run
****************************************************************/

SELECT_AND_RUN:
	procedure;

declare		INPUT_LENGTH         fixed binary (15);
declare		RETURN_CODE          fixed binary (15);

   /* REDIS_AND_SET - Redisplay the screen and set the var ptr */

   if NOT_FIRST_TIME then
      do;
      call DISPLAY_SCREEN (TK_MENU_1);

      /* SET_SCRN_VARS - Set the screen variables pointer */

      call SET_SCREEN_VARS (byteaddr (TK_MENU_RECORD) );
      end;
   NOT_FIRST_TIME = YES;

   /* INPUT_OPTION - Input the option on the screen */

   call INPUT_FIELD (  1,INPUT_LENGTH,RETURN_CODE);
   if (TK_SELECT = 0) !
        (RETURN_CODE ^= NORMAL_RETURN) then
      do;
      END_SELECT_AND_RUN = YES;
      return;
      end;

   /* CALL_PROGRAM - Dispatch to the right program */

   declare TK_CTRL_MAINT entry;
   declare TK_AIRL_MAINT entry;
   declare TK_AIRP_MAINT entry;
   declare TK_FLIGHT_MAINT entry;
   declare TK_FLIGHT_ADJ entry;
   declare TK_COUN_MAINT entry;
   declare TK_TICKET_PRT entry;
   declare TK_ARC_RPT entry;
   declare TK_OVER_MENU entry;
   declare TK_RPT_MENU entry;
   declare TK_OPEN_ADJ entry;
   declare TK_DIST_GL entry;
   declare TK_PURGE entry;
   do case (TK_SELECT);
         /* Option   1 */
      call TK_CTRL_MAINT(
);
         /* Option   2 */
      call TK_AIRL_MAINT(
);
         /* Option   3 */
      call TK_AIRP_MAINT(
);
         /* Option   4 */
      call TK_FLIGHT_MAINT(
);
         /* Option   5 */
      call TK_FLIGHT_ADJ(
);
         /* Option   6 */
      call TK_COUN_MAINT(
);
         /* Option   7 */
      call TK_TICKET_PRT(
);
         /* Option   8 */
      call TK_ARC_RPT(
);
         /* Option   9 */
      call TK_OVER_MENU(
);
         /* Option  10 */
      call TK_RPT_MENU(
);
         /* Option  11 */
      call TK_OPEN_ADJ(
);
         /* Option  12 */
      call TK_DIST_GL(
);
         /* Option  13 */
      call TK_PURGE(
);
   end;
   otherwise
      do;
      end;
return;
end;	/* SELECT_AND_RUN       */

/****************************************************************
	END_PROGRAM
	End of program stuff
****************************************************************/

END_PROGRAM:
	procedure;


   /* CLOSE_FILES - Close all the files for this program */

return;
end;	/* END_PROGRAM          */
end;	/* END_PROGRAM          */
/*********************************End of Program*********************/
